module.exports = [
  {
    title: "查找",
    children: [
      "查找/查找",
      "查找/二维数组查找",
      "查找/旋转数组的最小数字",
      "查找/在排序数组中查找数字",
    ],
  },
  {
    title: "DFS和BFS",
    children: [
      "DFS和BFS/DFS和BFS"
    ],
  },
  {
    title: "递归和循环",
    children: [
      "递归和循环/递归",
      "递归和循环/斐波拉契数列",
      "递归和循环/跳台阶",
      "递归和循环/变态跳台阶",
      "递归和循环/矩形覆盖",
    ],
  },
  {
    title: "分治",
    children: ["分治/数组中的逆序对"],
  },
  {
    title: "回溯算法",
    children: [
      "回溯算法/回溯算法",
      "回溯算法/二叉树中和为某一值的路径",
      "回溯算法/字符串的排列",
      "回溯算法/和为sum的n个数",
      "回溯算法/矩阵中的路径",
      "回溯算法/机器人的运动范围",
      "回溯算法/N皇后问题",
      "回溯算法/N皇后问题2",
    ],
  },
  {
    title: "排序",
    children: [
      "排序/复杂度",
      "排序/排序",
      "排序/插入排序",
      "排序/堆排序",
      "排序/归并排序",
      "排序/快速排序",
      "排序/冒泡排序",
      "排序/选择排序",
    ],
  },
  {
    title: "数学运算",
    children: [
      "数学运算/1+2+3+...+n",
      "数学运算/不用加减乘除做加法",
      "数学运算/丑数",
      "数学运算/二进制中1的个数",
      "数学运算/数值的整数次方",
      "数学运算/数组中只出现一次的数字",
      "数学运算/整数中1出现的次数",
      "数学运算/字符串转换成整数",
    ],
  },
  {
    title: "动态规划",
    children: [
      "动态规划/动态规划",
      "动态规划/最小路径和",
      "动态规划/打家劫舍",
    ],
  },
  {
    title: "贪心算法",
    children: ["贪心算法/贪心算法", "贪心算法/分发饼干"],
  },
];
